app/views/users/index.html.erb

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1
---
        <select  class="custom-select">
          <% user.microposts.each do |microposts| %>