app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password`, `name`, `email`, `created_at`, `updated_at`) VALUES ('test nek', '132562666', 'lam lam', 'adsadasd@gmail.com', '2019-08-26 03:18:31', '2019-08-26 03:18:31')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `password` = '12345678', `updated_at` = '2019-08-23 08:45:05' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)